Repository: JIHUNJO123/english-vocab-app
Catalog: lib/l10n/app_*.arb
Languages: ar, fr, hi, id, ja, ko, ms, tr, ur, zh

# enjoyAdFree
source: Enjoy your ad-free experience!
ar: استمتع بتجربتك بدون إعلانات!
fr: Profitez de votre expérience sans publicité!
hi: अपने विज्ञापन-मुक्त अनुभव का आनंद लें!
id: Nikmati pengalaman tanpa iklan!
ja: 広告なしの体験をお楽しみください！
ko: 광고 없이 즐기세요!
ms: Nikmati pengalaman tanpa iklan!
tr: Reklamsız deneyiminizin tadını çıkarın!
ur: اشتہارات کے بغیر تجربے کا لطف اٹھائیں!
zh: 享受无广告体验！

source: Restore Purchase
ar: استعادة المشتريات
fr: Restaurer l'achat
hi: खरीदारी पुनर्स्थापित करें
id: Pulihkan Pembelian
ja: 購入を復元
ko: 구매 복원
ms: Pulihkan Pembelian
tr: Satın Almayı Geri Yükle
ur: خریداری بحال کریں
zh: 恢复购买

# restorePurchaseDesc
source: Reinstalled or switched devices? Tap here to restore your ad-free purchase.
ar: أعدت تثبيت التطبيق أو غيرت الجهاز؟ اضغط هنا لاستعادة شراء إزالة الإعلانات.
fr: Vous avez réinstallé l'app ou changé d'appareil ? Appuyez ici pour restaurer votre achat sans pub.
hi: ऐप को पुनः इंस्टॉल किया या डिवाइस बदला? विज्ञापन-मुक्त खरीदारी को पुनर्स्थापित करने के लिए यहां टैप करें।
id: Menginstal ulang aplikasi atau ganti perangkat? Ketuk di sini untuk memulihkan pembelian bebas iklan Anda.
ja: 再インストールまたは機種変更しましたか？こちらをタップして広告削除の購入を復元してください。
ko: 앱을 재설치하거나 기기를 변경하셨나요? 여기를 눌러 광고 제거 구매를 복원하세요.
ms: Memasang semula aplikasi atau menukar peranti? Ketik di sini untuk memulihkan pembelian tanpa iklan anda.
tr: Uygulamayı yeniden yüklediniz veya cihaz değiştirdiniz mi? Reklamsız satın alımınızı geri yüklemek için buraya dokunun.
ur: ایپ دوبارہ انسٹال کی یا ڈیوائس بدلی؟ اشتہار فری خریداری بحال کرنے کے لیے یہاں ٹیپ کریں۔
zh: 重新安装应用或更换设备了吗？点击此处恢复您的去广告购买。

# purchaseFailed
source: Purchase failed. Please try again.
ar: فشلت عملية الشراء. يرجى المحاولة مرة أخرى.
fr: L'achat a échoué. Veuillez réessayer.
hi: खरीदारी विफल हुई। कृपया पुनः प्रयास करें।
id: Pembelian gagal. Silakan coba lagi.
ja: 購入に失敗しました。もう一度お試しください。
ko: 구매에 실패했습니다. 다시 시도해주세요.
ms: Pembelian gagal. Sila cuba lagi.
tr: Satın alma başarısız oldu. Lütfen tekrar deneyin.
ur: خریداری ناکام۔ براہ کرم دوبارہ کوشش کریں۔
zh: 购买失败，请重试。

# purchaseRestored
source: Purchase restored successfully!
ar: تمت استعادة عملية الشراء بنجاح!
fr: Achat restauré avec succès!
hi: खरीदारी सफलतापूर्वक पुनर्स्थापित!
id: Pembelian berhasil dipulihkan!
ja: 購入が正常に復元されました！
ko: 구매가 복원되었습니다!
ms: Pembelian berjaya dipulihkan!
tr: Satın alma başarıyla geri yüklendi!
ur: خریداری کامیابی سے بحال ہو گئی!
zh: 购买恢复成功！

# noPurchaseToRestore
source: No purchase found to restore
ar: لا توجد عملية شراء للاستعادة
fr: Aucun achat à restaurer
hi: पुनर्स्थापित करने के लिए कोई खरीदारी नहीं मिली
id: Tidak ada pembelian untuk dipulihkan
ja: 復元する購入が見つかりません
ko: 복원할 구매 내역이 없습니다
ms: Tiada pembelian untuk dipulihkan
tr: Geri yüklenecek satın alma bulunamadı
ur: بحال کرنے کے لیے کوئی خریداری نہیں ملی
zh: 没有可恢复的购买

source: Buy
ar: شراء
fr: Acheter
hi: खरीदें
id: Beli
ja: 購入
ko: 구매
ms: Beli
tr: Satın Al
ur: خریدیں
zh: 购买

# wordFontSize
source: Flashcard Idiom Size
ko: 플래시카드 숙어 크기

# fontSizeSmall
source: Small
ko: 작게

# fontSizeMediumSmall
source: Medium Small
ko: 약간 작게

# fontSizeNormal
source: Normal
ko: 보통

# fontSizeMediumLarge
source: Medium Large
ko: 약간 크게

# fontSizeLarge
source: Large
ko: 크게

# fontSizeExtraLarge
source: Extra Large
ko: 매우 크게

# appTitle
source: English Idiom 1000
ar: Essential English 10000
fr: Essential English 10000
hi: Essential English 10000
id: English Word 10000
ja: Essential English 10000
ms: English Word 10000
tr: English Word 10000
ur: English Word 10000
zh: English Word 10000
