Repository: JIHUNJO123/english-vocab-app
Catalog: lib/l10n/app_*.arb
Languages: ar, fr, hi, id, ja, ko, ms, tr, ur, zh

# todayWord
source: Today's Idiom
ar: تعبير اليوم
fr: Expression du jour
hi: आज का मुहावरा
id: 📅 Kata hari ini
ja: 今日の単語
ko: 오늘의 숙어
ms: 📅 Perkataan Hari Ini
tr: 📅 Günün Kelimesi
ur: 📅 آج کا لفظ
zh: 📅 今日单词

source: Learning
ar: التعلم
fr: Apprendre
hi: सीखना
id: Belajar
ja: 学習
ko: 학습하기
ms: Pembelajaran
tr: Öğrenme
ur: سیکھنا
zh: 学习

source: Level Learning
ar: التعلم حسب المستوى
fr: Par niveau
hi: स्तर के अनुसार सीखना
id: Per tingkat
ja: レベル別学習
ko: 난이도별 학습
ms: Pembelajaran Mengikut Tahap
tr: Seviyeye Göre Öğrenme
ur: سطح کے مطابق سیکھنا
zh: 分级学习

# allWords
source: All Idioms
ar: كل التعابير
fr: Toutes les expressions
hi: सभी मुहावरे
id: Semua
ja: 全単語
ko: 전체 숙어
ms: Semua Perkataan
tr: Tüm Kelimeler
ur: تمام الفاظ
zh: 全部单词

# viewAllWords
source: View all idioms
ar: عرض جميع التعابير
fr: Voir toutes les expressions
hi: सभी मुहावरे देखें
id: Lihat semua kata
ja: すべての単語を見る
ko: 모든 숙어 보기
ms: Lihat semua perkataan
tr: Tüm kelimeleri görüntüle
ur: تمام الفاظ دیکھیں
zh: 查看所有单词

source: Favorites
ar: المفضلة
fr: Favoris
hi: पसंदीदा
id: Favorit
ja: お気に入り
ko: 즐겨찾기
ms: Kegemaran
tr: Favoriler
ur: پسندیدہ
zh: 收藏夹

# savedWords
source: Saved idioms
ar: التعابير المحفوظة
fr: Expressions enregistrées
hi: सहेजे गए मुहावरे
id: Kata tersimpan
ja: 保存した単語
ko: 저장한 숙어
ms: Perkataan tersimpan
tr: Kayıtlı kelimeler
ur: محفوظ الفاظ
zh: 已保存

source: Flashcard
ar: بطاقات تعليمية
fr: Cartes
hi: फ्लैशकार्ड
id: Kartu
ja: フラッシュカード
ko: 플래시카드
ms: Kad Imbasan
tr: Kartlar
ur: فلیش کارڈ
zh: 闪卡

# cardLearning
source: Learn with cards
ar: التعلم بالبطاقات
fr: Apprendre avec cartes
hi: कार्ड से सीखें
id: Belajar dengan kartu
ja: カードで学習
ko: 카드로 학습
ms: Belajar dengan kad
tr: Kartlarla öğren
ur: کارڈز سے سیکھیں
zh: 卡片学习

source: Search
ar: بحث
fr: Rechercher
hi: खोजें
id: Cari
ja: 検索
ko: 검색
ms: Cari
tr: Ara
ur: تلاش
zh: 搜索

# searchWords
source: Search idioms
ar: البحث عن تعابير
fr: Chercher des expressions
hi: मुहावरे खोजें
id: Cari kata
ja: 単語を探す
ko: 숙어 찾기
ms: Cari perkataan
tr: Kelime ara
ur: الفاظ تلاش کریں
zh: 搜索单词

source: Settings
ar: الإعدادات
fr: Paramètres
hi: सेटिंग्स
id: Pengaturan
ja: 設定
ko: 설정
ms: Tetapan
tr: Ayarlar
ur: ترتیبات
zh: 设置

# noWords
source: No idioms found
ar: لا توجد تعابير
fr: Aucune expression
hi: कोई मुहावरा नहीं मिला
id: Tidak ada kata
ja: 単語がありません
ko: 숙어가 없습니다
ms: Tiada perkataan dijumpai
tr: Kelime bulunamadı
ur: کوئی الفاظ نہیں ملے
zh: 没有单词

# cannotLoadWords
source: Cannot load idioms
ar: لا يمكن تحميل التعابير
fr: Impossible de charger
hi: मुहावरे लोड नहीं हो सकते
id: Tidak bisa memuat
ja: 単語を読み込めません
ko: 숙어를 불러올 수 없습니다
ms: Tidak dapat memuatkan perkataan
tr: Kelimeler yüklenemedi
ur: الفاظ لوڈ نہیں ہو سکے
zh: 无法加载单词

source: Added to favorites
ar: تمت الإضافة للمفضلة
fr: Ajouté aux favoris
hi: पसंदीदा में जोड़ा गया
id: Ditambahkan ke favorit
ja: お気に入りに追加しました
ko: 즐겨찾기에 추가되었습니다
ms: Ditambah ke kegemaran
tr: Favorilere eklendi
ur: پسندیدہ میں شامل
zh: 已添加到收藏夹

source: Removed from favorites
ar: تمت الإزالة من المفضلة
fr: Retiré des favoris
hi: पसंदीदा से हटाया गया
id: Dihapus dari favorit
ja: お気に入りから削除しました
ko: 즐겨찾기에서 제거되었습니다
ms: Dikeluarkan dari kegemaran
tr: Favorilerden kaldırıldı
ur: پسندیدہ سے ہٹا دیا گیا
zh: 已从收藏夹移除

source: Definition
ar: 📖 التعريف
fr: 📖 Définition
hi: 📖 परिभाषा
id: 📖 Arti
ja: 📖 意味
ko: 뜻
ms: 📖 Definisi
tr: 📖 Tanım
ur: 📖 تعریف
zh: 📖 释义

source: Example
ar: 💬 مثال
fr: 💬 Exemple
hi: 💬 उदाहरण
id: 💬 Contoh
ja: 💬 例文
ko: 예문
ms: 💬 Contoh
tr: 💬 Örnek
ur: 💬 مثال
zh: 💬 例句

source: Translating...
ar: جاري الترجمة...
fr: Traduction...
hi: अनुवाद हो रहा है...
id: Menerjemahkan...
ja: 翻訳中...
ko: 번역 중...
ms: Menterjemah...
tr: Çevriliyor...
ur: ترجمہ ہو رہا ہے...
zh: 翻译中...

source: Listen Pronunciation
ar: استمع للنطق
fr: Écouter
hi: उच्चारण सुनें
id: Dengar
ja: 発音を聞く
ko: 발음 듣기
ms: Dengar Sebutan
tr: Telaffuzu Dinle
ur: تلفظ سنیں
zh: 听发音

source: Mark as Learned
ar: تم التعلم
fr: Marquer appris
hi: सीखा हुआ चिह्नित करें
id: Tandai sudah dipelajari
ja: 学習済み
ko: 학습 완료
ms: Tandakan Sebagai Dipelajari
tr: Öğrenildi Olarak İşaretle
ur: سیکھا ہوا نشان لگائیں
zh: 标记已学

source: Previous
ar: السابق
fr: Précédent
hi: पिछला
id: Sebelum
ja: 前へ
ko: 이전
ms: Sebelumnya
tr: Önceki
ur: پچھلا
zh: 上一个

source: Next
ar: التالي
fr: Suivant
hi: अगला
id: Berikut
ja: 次へ
ko: 다음
ms: Seterusnya
tr: Sonraki
ur: اگلا
zh: 下一个

# pronunciation
source: Pronounce
ar: النطق
fr: Prononcer
hi: उच्चारण
id: Ucapkan
ja: 発音
ko: 발음
ms: Sebutan
tr: Telaffuz
ur: تلفظ
zh: 发音

source: Tap to flip
ar: انقر للقلب
fr: Appuyez pour retourner
hi: पलटने के लिए टैप करें
id: Ketuk untuk membalik
ja: タップして裏返す
ko: 탭하여 뒤집기
ms: Ketuk untuk terbalik
tr: Çevirmek için dokun
ur: پلٹنے کے لیے ٹیپ کریں
zh: 点击翻转

# levelA1
source: Beginner 1
ar: مبتدئ 1
fr: Débutant 1
hi: शुरुआती 1
id: Pemula 1
ja: 初級1
ko: 초급 1
ms: Permulaan 1
tr: Başlangıç 1
ur: ابتدائی ۱
zh: 初级1

# levelA2
source: Beginner 2
ar: مبتدئ 2
fr: Débutant 2
hi: शुरुआती 2
id: Pemula 2
ja: 初級2
ko: 초급 2
ms: Permulaan 2
tr: Başlangıç 2
ur: ابتدائی ۲
zh: 初级2

# levelB1
source: Intermediate 1
ar: متوسط 1
fr: Intermédiaire 1
hi: मध्यवर्ती 1
id: Menengah 1
ja: 中級1
ko: 중급 1
ms: Pertengahan 1
tr: Orta 1
ur: درمیانی ۱
zh: 中级1

# levelB2
source: Intermediate 2
ar: متوسط 2
fr: Intermédiaire 2
hi: मध्यवर्ती 2
id: Menengah 2
ja: 中級2
ko: 중급 2
ms: Pertengahan 2
tr: Orta 2
ur: درمیانی ۲
zh: 中级2

# levelC1
source: Advanced
ar: متقدم
fr: Avancé
hi: उन्नत
id: Lanjutan
ja: 上級
ko: 고급
ms: Lanjutan
tr: İleri
ur: ایڈوانس
zh: 高级

# levelWords
source: {level} Idioms
ar: تعابير {level}
fr: Expressions {level}
hi: {level} मुहावरे
id: Kata {level}
ja: {level} 単語
ko: {level} 숙어
ms: Perkataan {level}
tr: {level} Kelimeler
ur: {level} الفاظ
zh: {level} 单词

source: Flashcard Mode
ar: وضع البطاقات
fr: Mode cartes
hi: फ्लैशकार्ड मोड
id: Mode kartu
ja: フラッシュカードモード
ko: 플래시카드 모드
ms: Mod Kad Imbasan
tr: Kart Modu
ur: فلیش کارڈ موڈ
zh: 闪卡模式

source: List Mode
ar: وضع القائمة
fr: Mode liste
hi: सूची मोड
id: Mode daftar
ja: リストモード
ko: 리스트 모드
ms: Mod Senarai
tr: Liste Modu
ur: فہرست موڈ
zh: 列表模式

source: Language
ar: اللغة
fr: Langue
hi: भाषा
id: Bahasa
ja: 言語
ko: 언어
ms: Bahasa
tr: Dil
ur: زبان
zh: 语言

# selectLanguage
source: Select Your Language
ar: اختر لغتك
fr: Choisir la langue
hi: अपनी भाषा चुनें
id: Pilih bahasa
ja: 言語を選択
ko: 언어 선택
ms: Pilih Bahasa Anda
tr: Dilinizi Seçin
ur: اپنی زبان منتخب کریں
zh: 选择语言

# languageChanged
source: Language changed to {language}
ar: تم تغيير اللغة إلى {language}
fr: Changé en {language}
hi: भाषा बदलकर {language} हो गई
id: Diganti ke {language}
ja: {language}に変更しました
ko: {language}로 변경되었습니다
ms: Bahasa ditukar kepada {language}
tr: Dil {language} olarak değiştirildi
ur: زبان {language} میں تبدیل ہو گئی
zh: 已切换到{language}

source: Translation Info
ar: معلومات الترجمة
fr: Info traduction
hi: अनुवाद जानकारी
id: Info terjemahan
ja: 翻訳について
ko: 번역 안내
ms: Maklumat Terjemahan
tr: Çeviri Bilgisi
ur: ترجمہ کی معلومات
zh: 翻译说明

# translationInfoDesc
source: Translations will be downloaded automatically when you view idioms. Once downloaded, they are cached locally for offline use.
ar: سيتم تنزيل الترجمات تلقائياً عند عرض الكلمات. بعد التنزيل، يتم تخزينها محلياً للاستخدام دون اتصال.
fr: Les traductions sont téléchargées automatiquement. Une fois téléchargées, elles sont disponibles hors ligne.
hi: शब्द देखते समय अनुवाद स्वचालित रूप से डाउनलोड हो जाएंगे। डाउनलोड होने के बाद, वे ऑफलाइन उपयोग के लिए स्थानीय रूप से कैश हो जाते हैं।
id: Terjemahan akan diunduh otomatis. Setelah diunduh, tersedia offline.
ja: 単語を見ると自動的に翻訳がダウンロードされます。ダウンロードした翻訳はオフラインでも使用できます。
ko: 숙어를 볼 때 자동으로 번역이 다운로드됩니다. 다운로드된 번역은 오프라인에서도 사용할 수 있도록 저장됩니다.
ms: Terjemahan akan dimuat turun secara automatik apabila anda melihat perkataan. Setelah dimuat turun, ia disimpan secara tempatan untuk kegunaan luar talian.
tr: Kelimeleri görüntülediğinizde çeviriler otomatik olarak indirilecektir. İndirildikten sonra çevrimdışı kullanım için yerel olarak önbelleğe alınır.
ur: الفاظ دیکھتے وقت ترجمے خود بخود ڈاؤن لوڈ ہوں گے۔ آف لائن استعمال کے لیے مقامی طور پر محفوظ ہوں گے۔
zh: 查看单词时会自动下载翻译。下载后可离线使用。

source: OK
ar: موافق
hi: ठीक है
ko: 확인
tr: Tamam
ur: ٹھیک ہے
zh: 确定

source: Dark Mode
ar: الوضع الداكن
fr: Mode sombre
hi: डार्क मोड
id: Mode gelap
ja: ダークモード
ko: 다크 모드
ms: Mod Gelap
tr: Karanlık Mod
ur: ڈارک موڈ
zh: 深色模式

source: Speech Rate
ar: سرعة النطق
fr: Vitesse
hi: बोलने की गति
id: Kecepatan
ja: 読み上げ速度
ko: 발음 속도
ms: Kelajuan Pertuturan
tr: Konuşma Hızı
ur: بولنے کی رفتار
zh: 朗读速度

source: Notifications
ar: الإشعارات
hi: सूचनाएं
id: Notifikasi
ja: 通知
ko: 알림
ms: Pemberitahuan
tr: Bildirimler
ur: اطلاعات
zh: 通知

source: Daily Reminder
ar: تذكير يومي
fr: Rappel quotidien
hi: दैनिक रिमाइंडर
id: Pengingat harian
ja: 毎日のリマインダー
ko: 매일 알림
ms: Peringatan Harian
tr: Günlük Hatırlatıcı
ur: روزانہ یاد دہانی
zh: 每日提醒

source: About
ar: حول
fr: À propos
hi: के बारे में
id: Tentang
ja: 情報
ko: 정보
ms: Tentang
tr: Hakkında
ur: کے بارے میں
zh: 关于

source: Version
ar: الإصدار
hi: संस्करण
id: Versi
ja: バージョン
ko: 버전
ms: Versi
tr: Sürüm
ur: ورژن
zh: 版本

source: Developer
ar: المطور
fr: Développeur
hi: डेवलपर
id: Pengembang
ja: 開発者
ko: 개발자
ms: Pembangun
tr: Geliştirici
ur: ڈویلپر
zh: 开发者

# searchHint
source: Search for idioms...
ar: ابحث عن كلمات...
fr: Rechercher des expressions...
hi: मुहावरे खोजें...
id: Cari kata...
ja: 単語を検索...
ko: 숙어를 검색하세요...
ms: Cari perkataan...
tr: Kelime ara...
ur: الفاظ تلاش کریں...
zh: 搜索单词...

# noSearchResults
source: No results found
ar: لا توجد نتائج
fr: Aucun résultat
hi: कोई परिणाम नहीं मिला
id: Tidak ada hasil
ja: 検索結果がありません
ko: 검색 결과가 없습니다
ms: Tiada hasil dijumpai
tr: Sonuç bulunamadı
ur: کوئی نتائج نہیں ملے
zh: 没有找到结果

# typeToSearch
source: Type to search for idioms
ar: اكتب للبحث عن كلمات
fr: Tapez pour rechercher
hi: शब्द खोजने के लिए टाइप करें
id: Ketik untuk mencari
ja: 単語を検索してください
ko: 숙어를 검색해 보세요
ms: Taip untuk mencari perkataan
tr: Kelime aramak için yazın
ur: الفاظ تلاش کرنے کے لیے ٹائپ کریں
zh: 输入以搜索单词

# noFavorites
source: No favorites yet
ar: لا توجد مفضلات بعد
fr: Aucun favori
hi: अभी तक कोई पसंदीदा नहीं
id: Belum ada favorit
ja: お気に入りがありません
ko: 즐겨찾기가 없습니다
ms: Tiada kegemaran lagi
tr: Henüz favori yok
ur: ابھی کوئی پسندیدہ نہیں
zh: 暂无收藏

# addFavoritesHint
source: Add idioms to favorites by tapping the heart icon
ar: أضف تعابير للمفضلة بالنقر على أيقونة القلب
fr: Appuyez sur le cœur pour ajouter
hi: हृदय आइकन पर टैप करके शब्द पसंदीदा में जोड़ें
id: Ketuk hati untuk menambahkan
ja: ハートアイコンをタップしてお気に入りに追加
ko: 하트 아이콘을 눌러 즐겨찾기에 추가하세요
ms: Tambah perkataan ke kegemaran dengan mengetuk ikon hati
tr: Kalp simgesine dokunarak favorilere kelime ekleyin
ur: دل کے آئیکن پر ٹیپ کرکے الفاظ پسندیدہ میں شامل کریں
zh: 点击心形图标添加收藏

# posNoun
source: noun
ar: اسم
fr: nom
hi: संज्ञा
id: kata benda
ja: 名詞
ko: 명사
ms: kata nama
tr: isim
ur: اسم
zh: 名词

# posVerb
source: verb
ar: فعل
fr: verbe
hi: क्रिया
id: kata kerja
ja: 動詞
ko: 동사
ms: kata kerja
tr: fiil
ur: فعل
zh: 动词

# posAdjective
source: adjective
ar: صفة
fr: adjectif
hi: विशेषण
id: kata sifat
ja: 形容詞
ko: 형용사
ms: kata sifat
tr: sıfat
ur: صفت
zh: 形容词

# posAdverb
source: adverb
ar: ظرف
fr: adverbe
hi: क्रिया विशेषण
id: kata keterangan
ja: 副詞
ko: 부사
ms: kata keterangan
tr: zarf
ur: متعلق فعل
zh: 副词

# posPronoun
source: pronoun
ar: ضمير
fr: pronom
hi: सर्वनाम
id: kata ganti
ja: 代名詞
ko: 대명사
ms: kata ganti nama
tr: zamir
ur: ضمیر
zh: 代词

# posPreposition
source: preposition
ar: حرف جر
fr: préposition
hi: पूर्वसर्ग
id: kata depan
ja: 前置詞
ko: 전치사
ms: kata sendi
tr: edat
ur: حرف جار
zh: 介词

# posConjunction
source: conjunction
ar: حرف عطف
fr: conjonction
hi: संयोजक
id: kata hubung
ja: 接続詞
ko: 접속사
ms: kata hubung
tr: bağlaç
ur: حرف عطف
zh: 连词

# posInterjection
source: interjection
ar: اسم تعجب
hi: विस्मयादिबोधक
id: kata seru
ja: 間投詞
ko: 감탄사
ms: kata seru
tr: ünlem
ur: حرف ندا
zh: 感叹词

# posArticle
source: article
ar: أداة تعريف
hi: उपपद
id: kata sandang
ja: 冠詞
ko: 관사
ms: kata sandang
tr: artikel
ur: حرف تعریف
zh: 冠词

# posDeterminer
source: determiner
ar: محدد
fr: déterminant
hi: निर्धारक
id: kata penentu
ja: 限定詞
ko: 한정사
ms: kata penentu
tr: belirleyici
ur: معین
zh: 限定词

# posAuxiliary
source: auxiliary verb
ar: فعل مساعد
fr: verbe auxiliaire
hi: सहायक क्रिया
id: kata kerja bantu
ja: 助動詞
ko: 조동사
ms: kata kerja bantu
tr: yardımcı fiil
ur: فعل معاون
zh: 助动词

# posPhrasal
source: phrasal verb
ar: فعل مركب
fr: verbe à particule
hi: वाक्यांश क्रिया
id: kata kerja frasa
ja: 句動詞
ko: 구동사
ms: kata kerja frasa
tr: deyimsel fiil
ur: محاوراتی فعل
zh: 短语动词

source: Show translation first
ar: عرض الترجمة أولاً
fr: Afficher la traduction d'abord
hi: पहले अनुवाद दिखाएं
id: Tampilkan terjemahan dulu
ja: 翻訳を先に表示
ko: 번역 먼저 표시
ms: Tunjukkan terjemahan dahulu
tr: Önce çeviriyi göster
ur: پہلے ترجمہ دکھائیں
zh: 先显示翻译

# showTranslationFirstDesc
source: Display translated meaning before English
ar: عرض المعنى المترجم قبل الإنجليزية
fr: Afficher la signification traduite avant l'anglais
hi: अंग्रेजी से पहले अनुवादित अर्थ दिखाएं
id: Tampilkan arti yang diterjemahkan sebelum bahasa Inggris
ja: 英語の前に翻訳された意味を表示
ko: 영어 전에 번역된 의미를 표시합니다
ms: Paparkan makna terjemahan sebelum Bahasa Inggeris
tr: İngilizceden önce çevrilmiş anlamı görüntüle
ur: انگریزی سے پہلے ترجمہ شدہ معنی دکھائیں
zh: 在英语之前显示翻译含义

source: Display
ar: العرض
fr: Affichage
hi: प्रदर्शन
id: Tampilan
ja: 表示
ko: 화면
ms: Paparan
tr: Görünüm
ur: ڈسپلے
zh: 显示

source: Use dark theme
ar: استخدام السمة الداكنة
fr: Utiliser le thème sombre
hi: डार्क थीम का उपयोग करें
id: Gunakan tema gelap
ja: ダークテーマを使用
ko: 어두운 테마 사용
ms: Gunakan tema gelap
tr: Karanlık tema kullan
ur: ڈارک تھیم استعمال کریں
zh: 使用深色主题

# restartToApply
source: Restart app to apply theme change
ar: أعد تشغيل التطبيق لتطبيق تغيير السمة
fr: Redémarrez l'app pour appliquer le changement de thème
hi: थीम परिवर्तन लागू करने के लिए ऐप पुनः आरंभ करें
id: Mulai ulang aplikasi untuk menerapkan perubahan tema
ja: テーマ変更を適用するにはアプリを再起動
ko: 테마 변경을 적용하려면 앱을 다시 시작하세요
ms: Mulakan semula aplikasi untuk menggunakan perubahan tema
tr: Tema değişikliğini uygulamak için uygulamayı yeniden başlatın
ur: تھیم تبدیلی لاگو کرنے کے لیے ایپ دوبارہ شروع کریں
zh: 重启应用以应用主题更改

# learningSection
source: Learning
ar: التعلم
fr: Apprentissage
hi: सीखना
id: Pembelajaran
ja: 学習
ko: 학습
ms: Pembelajaran
tr: Öğrenme
ur: سیکھنا
zh: 学习

# currentSpeed
source: Current: {speed}x
ar: الحالي: {speed}x
fr: Actuel: {speed}x
hi: वर्तमान: {speed}x
id: Saat ini: {speed}x
ja: 現在: {speed}倍速
ko: 현재: {speed}배속
ms: Semasa: {speed}x
tr: Mevcut: {speed}x
ur: موجودہ: {speed}x
zh: 当前: {speed}倍速

# getDailyReminders
source: Get daily learning reminders
ar: احصل على تذكيرات تعلم يومية
fr: Recevoir des rappels quotidiens
hi: दैनिक सीखने की याद दिलाएं
id: Dapatkan pengingat belajar harian
ja: 毎日学習リマインダーを受け取る
ko: 매일 학습 알림 받기
ms: Dapatkan peringatan pembelajaran harian
tr: Günlük öğrenme hatırlatıcıları al
ur: روزانہ سیکھنے کی یاد دہانیاں حاصل کریں
zh: 接收每日学习提醒

source: Copyright
ar: حقوق النشر
fr: Droits d'auteur
hi: कॉपीराइट
id: Hak cipta
ja: 著作権
ko: 저작권
ms: Hak Cipta
tr: Telif Hakkı
ur: کاپی رائٹ
zh: 版权

# copyrightDesc
source: All definitions are original or AI-generated
ar: جميع التعريفات أصلية أو مولدة بالذكاء الاصطناعي
fr: Toutes les définitions sont originales ou générées par IA
hi: सभी परिभाषाएं मूल या AI द्वारा उत्पन्न हैं
id: Semua definisi asli atau dibuat oleh AI
ja: すべての定義はオリジナルまたはAI生成
ko: 모든 정의는 오리지널 또는 AI 생성입니다
ms: Semua definisi adalah asli atau dijana AI
tr: Tüm tanımlar orijinal veya yapay zeka tarafından oluşturulmuştur
ur: تمام تعریفیں اصلی یا AI سے تیار کردہ ہیں
zh: 所有定义均为原创或AI生成

source: Copyright Notice
ar: إشعار حقوق النشر
fr: Avis de droits d'auteur
hi: कॉपीराइट नोटिस
id: Pemberitahuan hak cipta
ja: 著作権情報
ko: 저작권 안내
ms: Notis Hak Cipta
tr: Telif Hakkı Bildirimi
ur: کاپی رائٹ نوٹس
zh: 版权声明

# copyrightContent
source: All idiom definitions and example sentences in this app are original or AI-generated. No copyrighted dictionary content is used.\n\nTranslations are provided by MyMemory API (free translation service).
ar: جميع تعريفات التعابير والجمل المثال في هذا التطبيق أصلية أو مولدة بالذكاء الاصطناعي. لم يتم استخدام محتوى قاموس محمي بحقوق النشر.
fr: Toutes les définitions de mots et phrases d'exemple dans cette application sont originales ou générées par IA. Aucun contenu de dictionnaire protégé par le droit d'auteur n'est utilisé.
hi: इस ऐप में सभी मुहावरे परिभाषाएं और उदाहरण वाक्य मूल हैं या AI द्वारा उत्पन्न हैं। कोई कॉपीराइट शब्दकोश सामग्री का उपयोग नहीं किया गया है।
id: Semua definisi kata dan kalimat contoh dalam aplikasi ini adalah asli atau dibuat oleh AI. Tidak ada konten kamus berhak cipta yang digunakan. Terjemahan disediakan oleh MyMemory API (layanan terjemahan gratis).
ja: このアプリのすべての単語定義と例文はオリジナルまたはAIで生成されています。著作権のある辞書コンテンツは使用されていません。
ko: 이 앱의 모든 숙어 정의와 예문은 오리지널이거나 AI로 생성되었습니다. 저작권이 있는 사전 콘텐츠는 사용되지 않았습니다.\n\n번역은 MyMemory API(무료 번역 서비스)로 제공됩니다.
ms: Semua definisi perkataan dan ayat contoh dalam aplikasi ini adalah asli atau dijana AI.
tr: Bu uygulamadaki tüm kelime tanımları ve örnek cümleler orijinaldir veya yapay zeka tarafından oluşturulmuştur. Telif hakkıyla korunan sözlük içeriği kullanılmamıştır. Çeviriler MyMemory API (ücretsiz çeviri hizmeti) tarafından sağlanmaktadır.
ur: اس ایپ میں تمام الفاظ کی تعریفیں اور مثالی جملے اصلی یا AI سے تیار کردہ ہیں۔
zh: 此应用程序中的所有单词定义和例句均为原创或AI生成。未使用受版权保护的词典内容。 翻译由MyMemory API（免费翻译服务）提供。

source: Privacy Policy
ar: سياسة الخصوصية
fr: Politique de confidentialité
hi: गोपनीयता नीति
id: Kebijakan privasi
ja: プライバシーポリシー
ko: 개인정보 처리방침
ms: Dasar Privasi
tr: Gizlilik Politikası
ur: رازداری کی پالیسی
zh: 隐私政策

# privacyContent
source: This app does not collect, store, or share any personal information.\n\nTranslation requests are sent to MyMemory API for processing. No user data is stored on external servers.
ar: هذا التطبيق لا يجمع أو يخزن أو يشارك أي معلومات شخصية.
fr: Cette application ne collecte, ne stocke ni ne partage aucune information personnelle.
hi: यह ऐप कोई व्यक्तिगत जानकारी एकत्र, संग्रहीत या साझा नहीं करता है।
id: Aplikasi ini tidak mengumpulkan, menyimpan, atau membagikan informasi pribadi apa pun. Permintaan terjemahan dikirim ke MyMemory API untuk diproses. Data pengguna tidak disimpan di server eksternal.
ja: このアプリは個人情報を収集、保存、共有しません。
ko: 이 앱은 개인 정보를 수집, 저장 또는 공유하지 않습니다.\n\n번역 요청은 MyMemory API로 전송되어 처리됩니다. 사용자 데이터는 외부 서버에 저장되지 않습니다.
ms: Aplikasi ini tidak mengumpul, menyimpan atau berkongsi sebarang maklumat peribadi.
tr: Bu uygulama hiçbir kişisel bilgi toplamaz, saklamaz veya paylaşmaz. Çeviri istekleri işlenmek üzere MyMemory API'ye gönderilir. Kullanıcı verileri harici sunucularda saklanmaz.
ur: یہ ایپ کوئی ذاتی معلومات جمع، ذخیرہ یا شیئر نہیں کرتی۔
zh: 此应用程序不收集、存储或分享任何个人信息。 翻译请求发送到MyMemory API进行处理。用户数据不会存储在外部服务器上。

source: Alphabetical
ar: أبجدي
fr: Alphabétique
hi: वर्णानुक्रम
id: Abjad
ja: アルファベット順
ko: 알파벳순
ms: Abjad
tr: Alfabetik
ur: حروف تہجی
zh: 字母顺序

source: Random
ar: عشوائي
fr: Aléatoire
hi: यादृच्छिक
id: Acak
ja: ランダム
ko: 랜덤
ms: Rawak
tr: Rastgele
ur: بے ترتیب
zh: 随机

source: Quiz
ar: اختبار
hi: क्विज़
id: Kuis
ja: クイズ
ko: 퀴즈
ms: Kuiz
tr: Test
ur: کوئز
zh: 测验

source: Test yourself
ar: اختبر نفسك
fr: Testez-vous
hi: खुद को परखें
id: Uji dirimu
ja: 実力テスト
ko: 실력 테스트
ms: Uji diri anda
tr: Kendini test et
ur: خود کو آزمائیں
zh: 测试能力

# wordQuiz
source: Idiom Quiz
ar: اختبار التعابير
fr: Quiz d'expressions
hi: मुहावरा क्विज़
id: Kuis kosakata
ja: 単語クイズ
ko: 숙어 퀴즈
ms: Kuiz Perkataan
tr: Kelime testi
ur: لفظ کوئز
zh: 单词测验

# quizWithLevel
source: {level} Quiz
ar: اختبار {level}
fr: Quiz {level}
hi: {level} क्विज़
id: Kuis {level}
ja: {level} クイズ
ko: {level} 퀴즈
ms: Kuiz {level}
tr: {level} Testi
ur: {level} کوئز
zh: {level} 测验

# wordToMeaningMode
source: IdiomMeaning
ar: تعبير→معنى
fr: Expression→Sens
hi: मुहावरा→अर्थ
id: Kata→Arti
ja: 単語→意味
ko: 숙어뜻
ms: Perkataan→Makna
tr: Kelime→Anlam
ur: لفظ←معنی
zh: 单词→释义

# meaningToWordMode
source: MeaningIdiom
ar: معنى→تعبير
fr: Sens→Expression
hi: अर्थ→मुहावरा
id: Arti→Kata
ja: 意味→単語
ko: 뜻숙어
ms: Makna→Perkataan
tr: Anlam→Kelime
ur: معنی←لفظ
zh: 释义→单词

source: Quiz Complete!
ar: 🎉 اكتمل الاختبار!
fr: 🎉 Quiz terminé!
hi: 🎉 क्विज़ पूरा!
id: 🎉 Kuis selesai!
ja: 🎉 クイズ完了！
ko: 퀴즈 완료!
ms: 🎉 Kuiz Selesai!
tr: 🎉 Test tamamlandı!
ur: 🎉 کوئز مکمل!
zh: 🎉 测验完成！

# correctAnswers
source: {percentage}% Correct
ar: {percentage}% صحيح
hi: {percentage}% सही
id: {percentage}% Benar
ja: {percentage}% 正解
ko: {percentage}% 정답
ms: {percentage}% Betul
tr: {percentage}% Doğru
ur: {percentage}% درست
zh: {percentage}% 正确

source: Exit
ar: خروج
fr: Quitter
hi: बाहर
id: Keluar
ja: 終了
ko: 종료
ms: Keluar
tr: Çık
ur: باہر نکلیں
zh: 退出

source: Try Again
ar: حاول مرة أخرى
fr: Réessayer
hi: फिर से कोशिश करें
id: Coba lagi
ja: もう一度
ko: 다시 하기
ms: Cuba Lagi
tr: Tekrar dene
ur: دوبارہ کوشش کریں
zh: 再试一次

# quizCompleteMessage
source: Quiz Complete!
ar: اكتمل الاختبار!
fr: Quiz terminé!
hi: क्विज़ पूरा!
id: Kuis selesai!
ja: クイズ完了！
ko: 퀴즈 완료!
ms: Kuiz Selesai!
tr: Test tamamlandı!
ur: کوئز مکمل!
zh: 测验完成！

source: Excellent!
ar: ممتاز! 🌟
hi: उत्कृष्ट! 🌟
id: Luar biasa! 🌟
ja: 完璧です！ 🌟
ko: 완벽해요!
ms: Cemerlang! 🌟
tr: Mükemmel! 🌟
ur: بہترین! 🌟
zh: 太棒了！ 🌟

source: Great Job!
ar: عمل رائع! 👏
fr: Bon travail! 👏
hi: बहुत बढ़िया! 👏
id: Bagus sekali! 👏
ja: よくできました！ 👏
ko: 잘했어요!
ms: Hebat! 👏
tr: Harika iş! 👏
ur: شاباش! 👏
zh: 做得好！ 👏

source: Good Start!
ar: بداية جيدة! 💪
fr: Bon début! 💪
hi: अच्छी शुरुआत! 💪
id: Awal yang bagus! 💪
ja: いいスタート！ 💪
ko: 좋은 시작이에요!
ms: Permulaan Baik! 💪
tr: İyi başlangıç! 💪
ur: اچھی شروعات! 💪
zh: 好的开始！ 💪

source: Keep Practicing!
ar: استمر في التدريب! 📚
fr: Continuez à pratiquer! 📚
hi: अभ्यास जारी रखें! 📚
id: Terus berlatih! 📚
ja: もっと練習しよう！ 📚
ko: 더 연습해봐요!
ms: Teruskan Berlatih! 📚
tr: Pratik yapmaya devam et! 📚
ur: مشق جاری رکھیں! 📚
zh: 继续练习！ 📚

# whatIsTheMeaning
source: What is the meaning of this idiom?
ar: ما معنى هذا التعبير؟
fr: Quelle est la signification de ce mot?
hi: इस मुहावरे का अर्थ क्या है?
id: Apa arti kata ini?
ja: この単語の意味は何ですか？
ko: 이 숙어의 뜻은 무엇일까요?
ms: Apakah makna perkataan ini?
tr: Bu kelimenin anlamı nedir?
ur: اس لفظ کا مطلب کیا ہے؟
zh: 这个单词的意思是什么？

# whichWordMatches
source: Which idiom matches this meaning?
ar: أي تعبير يتطابق مع هذا المعنى؟
fr: Quelle expression correspond à ce sens?
hi: कौन सा मुहावरा इस अर्थ से मेल खाता है?
id: Kata mana yang cocok dengan arti ini?
ja: この意味に合う単語は？
ko: 이 뜻에 해당하는 숙어는?
ms: Perkataan mana yang sepadan dengan makna ini?
tr: Hangi kelime bu anlama uyuyor?
ur: کون سا لفظ اس معنی سے ملتا ہے؟
zh: 哪个单词符合这个意思？

# nextQuestion
source: Next
ar: التالي
fr: Suivant
hi: अगला
id: Berikutnya
ja: 次へ
ko: 다음
ms: Seterusnya
tr: İleri
ur: اگلا
zh: 下一题

source: Loading...
ar: جار التحميل...
fr: Chargement...
hi: लड ह रह ह...
id: Memuat...
ja: 読み込み中...
ko: 로딩 중...
ms: Memuatkan...
tr: Yükleniyor...
ur: لوڈ ہو رہا ہے...
zh: 加载中...

source: Remove Ads
ar: إزالة الإعلانات
fr: Supprimer les pubs
hi: विज्ञापन हटाएं
id: Hapus Iklan
ja: 広告を削除
ko: 광고 제거
ms: Buang Iklan
tr: Reklamları Kaldır
ur: اشتہارات ہٹائیں
zh: 移除广告

# removeAdsTitle
source: Remove All Ads
ar: إزالة جميع الإعلانات
fr: Supprimer toutes les pubs
hi: सभी विज्ञापन हटाएं
id: Hapus Semua Iklan
ja: すべての広告を削除
ko: 모든 광고 제거
ms: Buang Semua Iklan
tr: Tüm Reklamları Kaldır
ur: تمام اشتہارات ہٹائیں
zh: 移除所有广告

# removeAdsDesc
source: Enjoy ad-free learning experience
ar: استمتع بتجربة تعلم بدون إعلانات
fr: Profitez d'un apprentissage sans publicité
hi: विज्ञापन-मुक्त सीखने का आनंद लें
id: Nikmati pengalaman belajar tanpa iklan
ja: 広告なしの学習体験をお楽しみください
ko: 광고 없이 학습하세요
ms: Nikmati pengalaman pembelajaran tanpa iklan
tr: Reklamsız öğrenme deneyiminin tadını çıkarın
ur: اشتہارات کے بغیر سیکھنے کا لطف اٹھائیں
zh: 享受无广告学习体验

source: Ads Removed
ar: تمت إزالة الإعلانات
fr: Publicités supprimées
hi: विज्ञापन हटा दिए गए
id: Iklan Dihapus
ja: 広告が削除されました
ko: 광고 제거됨
ms: Iklan Dibuang
tr: Reklamlar Kaldırıldı
ur: اشتہارات ہٹا دیے گئے
zh: 广告已移除
